In [26]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given the table tweets with info about, obviously, tweets. Write a query to obtain the amount of tweets posted per user in 2020 and order by user ASC. Write another query to obtain the amount of tweets posted per user in 2021 per hour of day and order by user hour DESC

In [27]:
%%sql

SELECT * FROM tweets LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(UUID('bfacc646-0d44-4009-86d7-83f6c4b94f0a'), 101, 'Loving the new data project! #datascience', datetime.datetime(2020, 3, 15, 10, 30)),
 (UUID('bea5d460-848d-4c40-828c-4f1bf9b4f7c8'), 102, 'Just finished a marathon, feeling great!', datetime.datetime(2020, 6, 22, 8, 15)),
 (UUID('96d73ee7-73ee-4a30-9a98-e9c41f7a2ba0'), 103, 'Coffee and code, my perfect morning routine.', datetime.datetime(2020, 9, 5, 7, 50)),
 (UUID('3989097b-8b50-4ff3-bdc0-30b0b1aa09c9'), 104, 'Exploring machine learning with PostgreSQL', datetime.datetime(2020, 12, 11, 14, 20)),
 (UUID('28e589d5-5387-405f-a3df-f3256e5e52b8'), 105, 'Watching the sunset, life is good.', datetime.datetime(2020, 11, 1, 18, 45)),
 (UUID('32d93f33-2022-4a82-b88c-9e8da76e954c'), 106, 'Reading a new book on AI trends.', datetime.datetime(2020, 5, 19, 16, 0)),
 (UUID('c0f5140b-ccfb-4cff-b7cb-e81a7f658051'), 101, 'Debugging Python all day! #programming', datetime.datetime(2021, 1, 10, 9, 30)),
 (UUID('b8a3d0b5-2b5e-42e2-aaae-727f296d9a73'), 102, 'Enjoying a sunny weekend at the park.', datetime.datetime(2020, 2, 14, 11, 15)),
 (UUID('840029c2-18e7-4eb7-80af-75a97445c564'), 103, 'Just launched my personal website!', datetime.datetime(2021, 3, 20, 13, 0)),
 (UUID('27519e6b-5920-4b53-b3cc-01c077eb4e98'), 104, 'Learning SQL joins, fun and challenging.', datetime.datetime(2021, 4, 25, 15, 40))]

In [30]:
%%sql

SELECT user_id,
       COUNT(*) AS tweets_count
FROM tweets
WHERE EXTRACT(YEAR FROM tweet_date) = 2020
GROUP BY user_id
ORDER BY user_id ASC;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(101, 3), (102, 4), (103, 3), (104, 3), (105, 3), (106, 4)]

In [31]:
%%sql

SELECT EXTRACT(HOUR FROM tweet_date) AS hour_of_day,
       COUNT(*) AS tweets_count
FROM tweets
WHERE EXTRACT(YEAR FROM tweet_date) = 2021
GROUP BY hour_of_day
ORDER BY hour_of_day DESC;

 * postgresql://user:***@localhost:5432/postgres
12 rows affected.

[(Decimal('22'), 1),
 (Decimal('19'), 1),
 (Decimal('18'), 1),
 (Decimal('16'), 1),
 (Decimal('15'), 2),
 (Decimal('14'), 1),
 (Decimal('13'), 1),
 (Decimal('12'), 1),
 (Decimal('11'), 1),
 (Decimal('10'), 1),
 (Decimal('9'), 2),
 (Decimal('7'), 2)]